In [6]:
import pandas as pd

In [7]:
df2 = pd.read_csv("../data/stud.csv")

In [8]:
df2=df2.assign(total_marks=df2['maths']+df2['physics']+df2['chemistry'])
df2=df2.assign(avg_marks=df2['total_marks']/3)

In [9]:
df2

   roll_no    name  maths  physics  chemistry  total_marks  avg_marks
0        1    Aman     78       65         70          213  71.000000
1        2    Riya     88       92         85          265  88.333333
2        3    Neha     45       55         50          150  50.000000
3        4   Arjun     90       85         88          263  87.666667
4        5   Priya     62       58         60          180  60.000000
5        6   Rohan     35       40         38          113  37.666667
6        7   Kavya     72       75         70          217  72.333333
7        8   Sahil     55       60         58          173  57.666667
8        9   Meena     80       78         82          240  80.000000
9       10  Aditya     92       95         90          277  92.333333

In [10]:
df2.head()

   roll_no   name  maths  physics  chemistry  total_marks  avg_marks
0        1   Aman     78       65         70          213  71.000000
1        2   Riya     88       92         85          265  88.333333
2        3   Neha     45       55         50          150  50.000000
3        4  Arjun     90       85         88          263  87.666667
4        5  Priya     62       58         60          180  60.000000

In [11]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   roll_no      10 non-null     int64
 1   name         10 non-null     object
 2   maths        10 non-null     int64
 3   physics      10 non-null     int64
 4   chemistry    10 non-null     int64
 5   total_marks  10 non-null     int64
 6   avg_marks    10 non-null     float64
dtypes: float64(1), int64(5), object(1)
memory usage: 692.0+ bytes

In [12]:
df2.isnull().sum()

roll_no        0
name           0
maths          0
physics        0
chemistry      0
total_marks    0
avg_marks      0
dtype: int64

In [13]:
df2.describe()

        roll_no      maths   physics  chemistry  total_marks  avg_marks
count  10.00000  10.000000  10.00000  10.000000    10.000000  10.000000
mean    5.50000  69.700000  70.30000  69.100000   209.100000  69.700000
std     3.02765  19.759948  17.68898  17.489362    54.314823  18.104941
min     1.00000  35.000000  40.00000  38.000000   113.000000  37.666667
25%     3.25000  56.750000  58.50000  58.500000   174.750000  58.250000
50%     5.50000  75.000000  70.00000  70.000000   215.000000  71.666667
75%     7.75000  86.000000  83.25000  84.250000   257.250000  85.750000
max    10.00000  92.000000  95.00000  90.000000   277.000000  92.333333

In [16]:
df2=df2.assign(status=df2['avg_marks'].apply(lambda x:"Pass" if x>=40 else "Fail"))

In [18]:
df2.head()

   roll_no   name  maths  physics  chemistry  total_marks  avg_marks status
0        1   Aman     78       65         70          213  71.000000   Pass
1        2   Riya     88       92         85          265  88.333333   Pass
2        3   Neha     45       55         50          150  50.000000   Pass
3        4  Arjun     90       85         88          263  87.666667   Pass
4        5  Priya     62       58         60          180  60.000000   Pass

In [22]:
topper=df2.loc[df2['avg_marks'].idxmax()]
topper

roll_no               10
name              Aditya
maths                 92
physics               95
chemistry             90
total_marks          277
avg_marks      92.333333
status              Pass
Name: 9, dtype: object

In [26]:
lowest=df2.loc[df2['avg_marks'].idxmin()]
lowest

roll_no                6
name               Rohan
maths                 35
physics               40
chemistry             38
total_marks          113
avg_marks      37.666667
status              Fail
Name: 5, dtype: object

In [41]:
result_count=df2["status"].value_counts()
result_count

status
Pass    9
Fail    1
Name: count, dtype: int64

In [45]:
sub_avg=df2[["maths","physics","chemistry"]].mean()
sub_avg

maths        69.7
physics      70.3
chemistry    69.1
dtype: float64

### Key Insights
- Majority of students passed the exam.
- The topper scored highest average marks across subjects.
- Chemistry has the lowest average score, indicating it may be the toughest subject.

In [47]:
pass_per=(result_count['Pass']/len(df2))*100
pass_per

np.float64(90.0)

90% Students are Passed the Examination

In [53]:
df2['avg_marks']=df2['avg_marks'].round(2)

In [54]:
df2.to_csv("../data/stud.csv", index=False)

In [55]:
df2.head()

   roll_no   name  maths  physics  chemistry  total_marks  avg_marks status
0        1   Aman     78       65         70          213      71.00   Pass
1        2   Riya     88       92         85          265      88.33   Pass
2        3   Neha     45       55         50          150      50.00   Pass
3        4  Arjun     90       85         88          263      87.67   Pass
4        5  Priya     62       58         60          180      60.00   Pass